Revit 2027 API
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
DistributionOfNormals |  Indicates the distribution of normal vectors along the tessellated mesh surface.
GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle
(Inherited from GeometryObject)
Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
(Inherited from GeometryObject)
IsClosed |  Indicates whether the mesh is closed.
IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.
(Inherited from GeometryObject)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
MaterialElementId | Element ID of the material from which this mesh is composed.
NumberOfNormals |  The number of normals associated with the mesh.
NumTriangles | The number of triangles that the mesh contains.
Transformed | Transforms this mesh and returns the result.
Triangle | Retrieves a specific triangle.
Vertices | Retrieves all vertices used to define this mesh. Intended for indexed access.
Visibility | The visibility.
(Inherited from GeometryObject)
Top
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace